# Дан список чисел. Определите, сколько в нем встречается различных чисел.

slist = [1, 1, 2, 0, -1, 3, 4, 4]
print(len(slist))